#!/usr/bin/env python3
# ----------------------------------------------------------------------------
# Created By  : Dmitriy Aldunin @DMcraft
# Created Date: 04/10/2023
# version ='2.10'
# Copyright 2023 Dmitriy Aldunin
# Licensed under the Apache License, Version 2.0
# ---------------------------------------------------------------------------

"""
PDF Shuffle

PDF Shuffle — ваш цифровой помощник для PDF. Легко собирайте, разбирайте и редактируйте
PDF-файлы и картинки как пазл. Перетаскивайте страницы, вставляйте сканы и сохраняйте результат в нужном вам виде.

Замучились переставлять страницы в PDF вручную? PDF Shuffle решает эту проблему!
Это простая программа на Python, которая позволяет:
Мешать как колоду: Перетаскивайте страницы между документами, удаляйте лишнее, поворачивайте.
Работать с картинками: Конвертируйте страницы PDF в JPG и наоборот.
Добавлять сканы: Вставляйте страницы прямо со сканера.
Гибко настраивать: Выбирайте качество, размер страницы и другие параметры под свои нужды.
Идеально для быстрого объединения отчетов, реорганизации документов и добавления фото в PDF.

Представьте, что ваш PDF — это стопка листов, а не монолитный файл. PDF Shuffle дает вам полный контроль
над этой стопкой! Добавьте несколько PDF и картинок (JPG/PNG), мышкой перетасуйте страницы как вам угодно,
добавьте страницу со сканера — и сохраните готовый документ. Всё интуитивно и без лишних сложностей.

"""

import sys
import os
from loguru import logger
from shuffle import main as shuffle_main

if __name__ == '__main__':
    logger.remove()
    if os.getenv('PRODUCTION') is None:
        logger.add("pdfshuffle.log", level="INFO", rotation="10 MB")
    else:
        logger.add(sys.stderr, level="DEBUG")

    print('Запуск программы...')

    try:
        shuffle_main()
    except Exception as e:
        logger.error(f"Произошла ошибка при выполнении программы: {e}")
        print(f"Ошибка: {e}")

    print('Программа завершена.')