#!/usr/bin/env python3
# ----------------------------------------------------------------------------
# Created By  : Dmitriy Aldunin @DMcraft
# Created Date: 04/10/2023
# version ='2.10'
# Copyright 2023 Dmitriy Aldunin
# Licensed under the Apache License, Version 2.0
# ---------------------------------------------------------------------------

"""
Модуль сканирования для PDF Shuffle
Этот модуль — как цифровая рука, которая берет документы прямо с вашего сканера и переносит их в программу.
Он отвечает за всё, что связано со сканированием в приложении PDF Shuffle.
Найти и подключить сканер: Сам увидит все подключенные сканеры и позволит вам выбрать нужный.
Гибко настраивать сканирование: Вы сможете легко поменять все основные настройки:
Цвет или ч/б: Решите, сканировать в цвете, в оттенках серого или черно-белом режиме.
Качество: Выставите нужное разрешение (DPI) — чем оно выше, тем четче, но больше размер файла.
Откуда сканировать: Выберите, положили вы документ на стекло планшета или подали из автоматического податчика (ADF).
Обрезать края: Можете указать точную область для сканирования, чтобы убрать лишнее.
Сохранить результат: Отсканированные страницы можно сохранить как в виде картинок (JPEG), так и сразу собрать в PDF-файл.
Работать автоматически: Можно задать папку, куда все файлы будут сохраняться сами, без лишних вопросов.
Запоминать: Он не забывает ваши любимые настройки и размер окна, чтобы в следующий раз вам было так же удобно.

Куда это всё сохраняется?
Все отсканированные страницы мгновенно появляются в основном окне программы PDF Shuffle,
где вы можете их просмотреть, упорядочить, собрать в PDF и отредактировать.

Этот модуль делает процесс оцифровки бумажных документов простым, быстрым и полностью интегрированным
в вашу работу с PDF-файлами.

"""

import sys
import os
from loguru import logger
import scaner

if __name__ == '__main__':
    # Удаление стандартного обработчика логов Loguru
    logger.remove()

    if os.getenv('PRODUCTION') is None:
        logger.add("pdfshuffle.log", level="INFO", rotation="10 MB")
    else:
        logger.add(sys.stderr, level="DEBUG")

    print('Запуск программы...')

    try:
        scaner.SCANER_START_MAIN = True
        scaner.main()
    except Exception as e:
        logger.error(f"Произошла ошибка при выполнении программы: {e}")
        print(f"Ошибка: {e}")

    print('Программа завершена.')